docs/posts/2023-02-05-new-hugo-functions.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 18, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>New Hugo Functions</title>
<meta name="author" content="Randall Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">New Hugo Functions</h1>
<p class="subtitle" role="doc-subtitle">Feb 05, 2023</p>
</header><p>
I found some some new functions for automating Hugo in Emacs, that I was able to modify slightly to fit my own needs.
</p>

<p>
<a href="https://whatacold.io/blog/2022-10-10-emacs-hugo-blogging/">Ken Huang</a> has a nice function to select a tag from a list of tags used on the site, then insert it into the right place in the front-matter. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun hugo-select-tags ()
  "Select tags from the hugo org files in the current dir.

Note that it only extracts tags from lines like the below:
#+tags[]: emacs org"
  (interactive)
  ;; Move to end of tag line.
  (save-excursion
    (goto-char 1)
    (re-search-forward "^#\\+tags")
    (end-of-line)

    (let ((files (directory-files-recursively default-directory "\\.org$")))
      (let ((source (with-temp-buffer
                      (while files
                        (when (file-exists-p (car files))
                          (insert-file-contents (car files)))
                        (pop files))
                      (buffer-string))))
        (save-match-data
          (let ((pos 0)
                matches)
            (while (string-match "^#\\+[Tt]ags\\[\\]: \\(.+?\\)$" source pos)
              (push (match-string 1 source) matches)
              (setq pos (match-end 0)))
            (insert
             (completing-read
              "Insert a tag: "
              (sort
               (delete-dups
                (delete "" (split-string
                            (replace-regexp-in-string "[\"\']" " "
                                                      (replace-regexp-in-string
                                                       "[,()]" ""
                                                       (format "%s" matches)))
                            " ")))
               (lambda (a b)
                 (string&lt; (downcase a) (downcase b))))))))))
    (insert " ")
    )
  )
</pre>
</div>


<p>
Look at this post from <a href="https://lucidmanager.org/productivity/create-websites-with-org-mode-and-hugo/">Peter Prevos</a>, for inserting links to other pages in the site. With it, you&rsquo;re able to just  <code>C-c C-l</code> to bring up a list of link types, select &ldquo;hugo&rdquo;, then pick the file name of the page you want to link. This is the code:
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp">;; Follow Hugo links
  (defun org-hugo-follow (link)
    "Follow Hugo link shortcodes"
    (org-link-open-as-file
     (string-trim "{{&lt;/* ref test.org */&gt;}}" "{{&lt;/* ref " "*/&gt;}}")))

  ;; New link type for Org-Hugo internal links
  (org-link-set-parameters
   "hugo"
   :complete (lambda ()
               (concat "{{&lt;/* ref "
                       (file-name-nondirectory
                        (read-file-name "File: "))
                       " */&gt;}}"))
   :follow #'org-hugo-follow)
</pre>
</div>



<p>
They both have some other useful things that might also be helpful. I&rsquo;m grateful to others who solve problems they have and post the code online. I know just enough Emacs-lisp to figure out what is going on, and modify something to my own particular use-case, but not enough to be able to start from scratch.
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 18, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15).
</div>
</footer>
</body>
</html>
